<template>

  <q-card-section class="rounded-borders border-1"
                  style="border: 1px solid white;

                  max-width: 70vw;
                  max-height: 70vh;
">

    <q-scroll-area style="max-height: 70vh;
                   height: 50vh;
                   min-height: 50vh;
                   width: 50vw;"
                   visible
                   bar-style="background-color:white; borderRadius: 5px;"
    >


      <q-input v-model="content"
               outlined readonly

               style="min-width: 50vw;"
               type="textarea" autogrow
               input-class="text-white"
      />
    </q-scroll-area>


  </q-card-section>


</template>

<script setup>


import { ref } from "vue";

const content = ref(`우리는 많이 풀이 바이며, 뼈 것이다. 가는 위하여서 기쁘며, 얼마나 그리하였는가? 예가 산야에 두손을 튼튼하며, 그리하였는가? 예수는 찾아다녀도, 가장 것이다. 아니한 원대하고, 이 얼마나 청춘의 철환하였는가? 뜨거운지라, 이상을 얼마나 운다. 이 보이는 인간이 이성은 구할 주며, 얼음에 우는 봄바람을 약동하다. 싸인 그러므로 인생을 날카로우나 피가 철환하였는가? 풀밭에 무한한 바로 보이는 않는 가슴에 사막이다. 풍부하게 오아이스도 귀는 앞이 아니다. 장식하는 피에 가슴이 청춘을 우는 있으랴?

굳세게 곳으로 그것은 열매를 이는 피에 사랑의 커다란 오아이스도 이것이다. 우리 간에 동산에는 청춘에서만 두손을 피는 따뜻한 그들의 봄바람이다. 불러 반짝이는 원질이 그들의 관현악이며, 황금시대의 이상의 가슴에 운다. 사라지지 이것을 그들은 사는가 눈에 그들의 너의 물방아 생생하며, 있으랴? 보내는 산야에 천자만홍이 청춘의 피다. 인간이 것은 끓는 트고, 풍부하게 있는 것은 이상 것이다. 품고 시들어 것은 들어 많이 대고, 방황하여도, 끓는다. 스며들어 소금이라 착목한는 가슴에 전인 있으랴? 미묘한 힘차게 하였으며, 가는 품에 아름다우냐?

인간은 가치를 보는 만물은 피는 발휘하기 바이며, 그것은 있는 사막이다. 무엇이 공자는 있는 약동하다. 같이 피어나는 타오르고 찬미를 듣기만 고동을 커다란 대한 있다. 피가 꽃이 행복스럽고 고행을 역사를 열매를 타오르고 아니다. 청춘을 그림자는 끓는 쓸쓸한 남는 대고, 이 위하여서. 찬미를 이상 살았으며, 방지하는 없으면 목숨이 이것이다. 든 따뜻한 인간이 피어나기 스며들어 인간에 밥을 방황하였으며, 산야에 사막이다. 풍부하게 두기 이상은 그들의 모래뿐일 철환하였는가? 봄바람을 인생을 뼈 어디 찬미를 이것이다. 찾아다녀도, 내려온 얼마나 봄바람이다.

위하여 듣기만 간에 되려니와, 것이다. 쓸쓸한 고동을 피부가 설레는 교향악이다. 청춘에서만 그들은 있는 날카로우나 보이는 사라지지 그들은 과실이 교향악이다. 뛰노는 때에, 살 동산에는 이상, 이상은 철환하였는가? 사람은 길지 오아이스도 못할 창공에 그들의 인간이 얼마나 무엇을 이것이다. 긴지라 커다란 바이며, 고행을 우리 듣기만 청춘의 것은 말이다. 오직 주며, 보이는 피어나는 인생을 같으며, 목숨이 수 피다. 귀는 하는 커다란 얼마나 아름답고 가는 청춘의 약동하다. 자신과 천하를 따뜻한 피가 뿐이다. 되려니와, 이상은 이상은 피가 불러 그들의 아름다우냐? 그림자는 든 청춘 유소년에게서 인간이 사람은 하는 있는 오직 칼이다.

속에 것이 미인을 인간의 때까지 하는 봄바람이다. 인간의 옷을 보배를 안고, 되는 천지는 청춘의 때문이다. 밥을 사랑의 광야에서 만물은 끓는 위하여, 하여도 보이는 쓸쓸하랴? 들어 싶이 노래하며 방황하여도, 그들의 이것이다. 부패를 뼈 긴지라 아름다우냐? 설산에서 있을 너의 이상은 뼈 두손을 피가 아니다. 곧 커다란 청춘 아름다우냐? 얼음에 이상의 이것을 길을 공자는 석가는 것이다. 우리의 무엇을 보는 설산에서 이상은 아름다우냐? 할지라도 얼마나 그들에게 오직 그림자는 아니한 낙원을 것이다.

이것을 구하지 만물은 바이며, 품으며, 것이다. 예가 못하다 찾아 인간은 청춘의 가지에 뜨거운지라, 얼음과 없는 것이다. 일월과 사람은 기관과 낙원을 스며들어 피다. 어디 기쁘며, 커다란 발휘하기 이상을 교향악이다. 없으면, 가치를 커다란 피가 기관과 천지는 것이다. 부패를 때까지 풍부하게 속에 같이, 있으랴? 안고, 청춘을 이상을 소금이라 것이다. 끓는 공자는 그들은 때에, 얼음이 무한한 스며들어 때까지 봄바람이다. 생생하며, 얼마나 하여도 전인 그들에게 같이, 품었기 반짝이는 아니다. 가치를 피고 돋고, 같이 능히 부패뿐이다.

평화스러운 이것을 대한 힘있다. 생생하며, 피가 안고, 심장의 교향악이다. 아름답고 얼마나 용기가 얼마나 있으랴? 어디 곧 이상은 충분히 청춘에서만 뼈 이상의 쓸쓸하랴? 싶이 생명을 인간의 유소년에게서 설레는 할지니, 얼마나 힘차게 청춘 사막이다. 이상의 거친 방황하여도, 품에 같이, 그들의 천자만홍이 몸이 소리다.이것은 이것이다. 광야에서 너의 가치를 이것은 영원히 부패를 이 듣는다. 이상 피가 있는 그리하였는가? 인간이 거친 되려니와, 놀이 공자는 말이다. 인간은 인생에 되는 것은 모래뿐일 예수는 말이다.

목숨을 설산에서 무엇을 이것은 이것을 쓸쓸한 것이다. 몸이 능히 끓는 투명하되 것이다. 때까지 찬미를 인생을 쓸쓸하랴? 그들의 찬미를 이상의 피어나기 안고, 이상 들어 튼튼하며, 말이다. 거친 풍부하게 얼마나 품에 군영과 무엇이 굳세게 것이다. 피가 이상 온갖 창공에 우리는 인간이 것이다. 피가 사랑의 그들은 어디 품으며, 투명하되 듣기만 그들의 피는 듣는다. 못할 열매를 트고, 가슴에 따뜻한 부패를 어디 따뜻한 이것이다. 풀밭에 지혜는 가장 때까지 약동하다. 우리 찾아다녀도, 있는 것은 것이 봄바람을 얼음에 있는가? 사람은 새가 오직 능히 소리다.이것은 아름답고 발휘하기 황금시대의 철환하였는가?

돋고, 그들의 위하여서, 보라. 예수는 못하다 보내는 대고, 사막이다. 것은 열락의 품에 충분히 있는가? 그들에게 보내는 청춘 오아이스도 청춘의 부패뿐이다. 열매를 이상의 영락과 용기가 가장 석가는 있는가? 피고, 스며들어 동력은 꾸며 얼음 이상의 이상 황금시대다. 소리다.이것은 얼마나 인생의 인생에 용기가 설레는 그들의 미묘한 아니다. 이 구하지 인생에 얼음과 방지하는 끓는 그들의 있다. 유소년에게서 가치를 뼈 살 찾아다녀도, 과실이 되려니와, 봄바람이다.

구하지 듣기만 예가 아니다. 평화스러운 원질이 가슴이 얼마나 웅대한 황금시대다. 이상 그들의 소담스러운 그들의 그러므로 끓는 풀이 천하를 뿐이다. 청춘 뜨고, 동산에는 것은 두기 청춘이 발휘하기 때까지 그들의 듣는다. 이상 오아이스도 뜨거운지라, 이것이야말로 그들에게 보이는 것은 끓는 동력은 사막이다. 돋고, 주는 따뜻한 옷을 넣는 그들을 위하여 꾸며 유소년에게서 봄바람이다. 갑 소담스러운 이상의 꾸며 기쁘며, 이것이다. 소담스러운 봄날의 살 듣는다. 인간에 인간이 못하다 가지에 관현악이며, 인간은 운다.

어디 미묘한 심장은 영락과 부패뿐이다. 그것을 풍부하게 고행을 피가 이상을 그들의 낙원을 천지는 노년에게서 약동하다. 현저하게 얼마나 미묘한 할지라도 황금시대다. 봄날의 위하여서 그들은 때에, 위하여 새가 아니다. 우리 오아이스도 것이 이상 아니다. 같이, 바로 피고 청춘의 얼음에 내는 그들에게 이것은 약동하다. 그들에게 곳으로 보는 생명을 풀이 할지니, 사막이다. 곧 하였으며, 같이 위하여서 얼마나 것이다. 소리다.이것은 내는 끝까지 있을 능히 무엇을 군영과 것이다.보라, 청춘 부패뿐이다. 위하여 끓는 끝에 않는 착목한는 피어나는 것은 관현악이며, 인류의 이것이다. 살 사람은 아니한 무한한 위하여서 부패를 용감하고 가슴이 위하여서.`);

</script>

<style scoped>

</style>
