<template>
  <div>

    <q-icon name="arrow_back_ios" color="white" size="md" class="q-ma-md"
            @click="onClickGoBack()"
            style="cursor: grab"
    />


    <div class="q-ma-sm">
      <q-scroll-area style="height: 90vh; width: 90vw;"
                     visible
                     bar-style="background-color:white; borderRadius: 5px;"
      >

        <div class="q-ma-md">

          <q-img :src="sampleImg" style="position: absolute; left: 0; max-width: 60vw;" />


          <div id="description" style="position: absolute; width: 40vw; right:0"
               class="q-gutter-y-md"
          >

            <div class="row items-start flex justify-center q-gutter-sm">

              <q-icon name="format_quote" color="white" size="sm"
                      style="transform: scaleX(-1);"
              />

              <div v-text="`아낌없이 주는 인간 비타민 ! 💊`"
                   class="character_saying text-center"
              />

              <q-icon name="format_quote" color="white" size="sm" />

            </div>


            <div class="row items-end q-gutter-md">
              <div v-text="`무라사키 아이미`"
                   class="character_detail_name"
              />


              <div v-text="`紫 愛美`"
                   class="character_detail_sub_name"
              />
            </div>

            <div class="character_detail_simple_info"
                 v-text="`12세 여 163cm 46kg`"
            />


            <pre v-text="firstSection" />

            <div v-text="`❀ 명랑한 ❀ 사교적 ❀ 호기심이 많은 ❀ 저돌적인 ❀ 베풀기를 좋아하는`"
                 class="character_detail_simple_info"
            />

            <q-expansion-item label="❀ 성격" class="character_detail_simple_info" dense
                              header-style="background-color: rgba(255, 255, 255, 0.1);
                                            borderRadius: 5px;"
            >
              <q-item-section>
                <pre v-text="identity"
                     style="font-size: 14px;"
                />
              </q-item-section>
            </q-expansion-item>


            <q-expansion-item label="❀ 기타사항" class="character_detail_simple_info" dense
                              header-style="background-color: rgba(255, 255, 255, 0.1);
                                            borderRadius: 5px;"
            >
              <q-item-section>
                <pre v-text="description"
                     style="font-size: 14px;"
                />
              </q-item-section>
            </q-expansion-item>

            <pre v-text="`무라사키 하토 - 쌍둥이 동생`"/>

          </div>

        </div>

      </q-scroll-area>

    </div>

  </div>
</template>

<script setup>


import { ref } from "vue";
import { useRouter } from "vue-router";

const $router = useRouter()

const onClickGoBack = () => {
  $router.go(-1)
}

const sampleImg = ref("https://img1.daumcdn.net/thumb/R1280x0/?scode=mtistory2&fname=https%3A%2F%2Fblog.kakaocdn.net%2Fdn%2Fcv5Lr0%2FbtrXt87hfDE%2FwUamyeiscFZnqNJlsmUXH1%2Fimg.png");

const firstSection = ref("연보랏빛에 아래쪽으로 내려갈수록 피치색 곱슬의 단발머리. 만지면 부들부들한 머리칼은 매일같이 누군가 모양새를 만져주는 것인지, 머리 스타일은 매일 조금씩 달라지지만 같은 날도 종종 있다. 하지만 워낙에 방방거리고 한시도 가만히 있지를 못해 집에 돌아갈 때쯤이면 이리저리 산발로 흐트러져있는 모습을 자주 볼 수 있다. 하얀 피부는 티 없이 맑았으나 이리저리 구르고 긁힌 상처가 가득해 피부가 성할 날이 없다. 동글동글한 눈매에 살랑이는 풍성한 속눈썹들은 자연스럽게 내려앉았고, 그 사이로는 회색빛이 도는 푸른 눈이 언제나 맑게 빛나며 반짝이고 있다.\n");

const identity = ref("❀ 명랑한\n" +
  "명랑하다. 그 말 한마디로 아이미를 정의하기엔 충분했으며, 이 아이에게서 명랑함이란 빼놓자면 시체나 다름없는 것이었다. 근심과 걱정, 어두운 부분이라고는 찾아볼 수 없을 정도로 활발하고 열정적이었으며 낙관적이고 모험을 좋아하는, 천진난만하고 쾌활한 어린아이. 때때로 주변 사람들이 피곤해하는 것도 같으나, 표정이나 몸짓 등 본인의 기분을 온몸으로 표현하며 언제나 기운 넘치고 생기 가득한 모습이 디폴트이기에 주변에서는 종종 인간 비타민이라는 평을 듣는 편이다.\n" +
  "\n" +
  "❀ 사교적\n" +
  "워낙에 사람을 좋아하고 붙임성이 좋은 탓에 어딘가의 외지에 홀로 툭 떨어져도 도태되거나 기가 죽을 일은 없을 것이다. 오히려 그런 상황조차 재밌다며 즐기고 있을법한 게 타고난 성정이었으니, 낯을 가리는 모습 따위는 찾아보기가 어려운 것은 물론이거니와 적응력 역시 타고난 탓에 성별, 나이에 무관하게 타인과 쉽게 어울리는 친화력을 지녔다. 항상 주변 사람을 사랑하고 상냥하게 대하라는 부모의 가르침과 타고나길 남을 의심하고 미워하지 못해 어찌 보면 당연하다 싶다지만 아이미는 주변에 존재하는, 아니 세상에 존재하는 모든 것들에 평균 이상의 호감을 나타내곤 했다.\n" +
  "\n" +
  "❀ 호기심이 많은\n" +
  "익숙한 것보다는 새로운 것에 도전하며 얻는 성취감을 즐긴다. 익숙함이 주는 안정감과 평화도 좋지만 경험해보지 못한, 새로운 발견을 한다면 순순히 그러려니- 하고 지나치지 못했다. 가만히 있으면 좀이라도 쑤시는 건지, 교실뿐만 아니라 학교와 마을 이곳저곳을 돌아다니다 마음에 쏙 드는 친구가 있다면 손을 잡고서, 여의치 않다면 제 쌍둥이 동생을 끌고 동네의 처음 보는 허름한 가게를 무작정 들어가 본다거나 마을 곳곳을 종일 쏘다니기 일쑤. 그 때문에 주변 사람들이 피곤해하는 것도 같지만….\n" +
  "\n" +
  "❀ 저돌적인\n" +
  "위와 같은 이유에서일까, 일단 무언가가 떠오르면 즉시 실행해야 직성이 풀리는 미친듯한 행동파. 순전히 호기심과 그것에서 오는 충동으로 말미암은 행동을 저지르는 일이 잦으며, 당연히 앞뒤 따위는 가리지 않는다. 이것저것 재고 따지며 고민할 시간에 한 번 부딪혀보지 뭐!, 라는 마음가짐에서 나오는 행동인 듯한데… 불행히도, 이런 성향이 종종 나쁜 결과를 초래하는 것은 어쩌면 당연한 일이었다. 이런 아이미의 즉흥적인 면모는 쌍둥이 동생인 하토조차 어떻게 컨트롤하지 못하는 듯. 그렇지만 자신의 행동이 불러온 결과에 대한 자각은 있는 건지, 실수 후엔 진심 어리게 사과한다. \n" +
  "\n" +
  "❀ 베풀기를 좋아하는\n" +
  "햇살처럼 살가운 성격에 항상 주변엔 사람들이 넘쳐났고, 아이미도 혼자보다는 단체 생활을 좋아했다. 당연하게도 그에 비례하게 정도 많았다. 기본적으로 배려심이 깊고 상냥하지만, 자존감이 높고 저돌적인 탓에 호의를 가끔 제멋대로 베풀고는 한다. 정이 들었다던가, (일방적으로) 친밀하다고 느끼는, 혹은 친해지고 싶은 대상에서 선물이나 갖은 호의적 행동 등을 아끼지 않는다. 제멋대로 같이 놀자며 손을 잡고 끌고 가버리는 것은 다반사에, 사소한 것부터 생일이나 상대가 평소 좋아하거나 필요한 것까지, 부탁하지도 않은 것을 덜컥 선물해준다던가하는 일도 잦다. 말 그대로 호감을 느낀 상대에게 제멋대로 치근덕대는 성격.\n");


const description = ref("\n" +
  "01.무라사키 아이미\n" +
  "1-1. 2월 23일생ㅣ물고기 자리ㅣRH+O형ㅣ오른손잡이\n" +
  "탄생화 : 살구꽃\n" +
  "탄생석 : 자수정\n" +
  "\n" +
  "1-2. 코우쇼 마을로 오기 전 잠깐이지만 아역 모델로 활동했다. 부모님 모두 음악 업계에 종사하고 있어 우연히 얻은 기회로 시작했던 것이지만, 나름대로 즐겁고 뜻깊은 경험이었던 듯.\n" +
  "\n" +
  "1-3. 말투, 호칭\n" +
  "- 지치지도 않는지, 언제나 즐겁다는 느낌을 줄 정도로 하이텐션을 유지한다. 말하는 문장 중간중간에 빈번하게 감탄사가 들어가는 편.\n" +
  "- 기본적으로 반말을 사용하지만, 연장자나 처음 보는 이들에겐 존댓말을 사용한다. 물론 제 판단하에 나이가 같거나 어려 보이는 사람이라면 다짜고짜 말을 놓아버리곤 한다.\n" +
  "- 상대를 부르는 호칭은 항상 제멋대로. 일방적으로 상대를 이름으로 부르거나 성과 이름에서 제 마음에 드는 글자를 따서 멋대로 줄여 부르는 것이 습관이다.\n" +
  "\n" +
  "1-4. 소지품\n" +
  "마이멜로디 캐릭터 모양의 가방속에는 손수건과 알록달록한 반창고, 작은 초콜릿 몇 개가 들어있다.\n" +
  "\n" +
  "\n" +
  "02. 무라사키 가족\n" +
  "2-1. 가족은 은퇴한 피아니스트인 어머니와 음악 관계자인 아버지, 그리고 쌍둥이 남동생인 하토 네사람과 보더콜리 브로콜리(ブロッコリー)와 고슴도치 낑깡(キンカン), 하토가 키우는 거북이인 테드 윌리엄스로 이루어져 있다.\n" +
  "\n" +
  "2-2. 오사카시 출신. 도시에서 나고 자랐지만, 어머니의 건강 문제로 3년 전 코우쇼로 이사를 왔다. 현재는 코우쇼 마을 외곽의 복숭아나무가 심어진 큰 단독 주택에서 살고 있다. 푸른 잔디가 넓게 깔린 마당에는 갖가지 나무와 꽃들이 심겨 있고, 작은 연못 또한 갖추어져 있다. \n" +
  "\n" +
  "2-3. 동생인 하토와는 사이가 꽤 좋은 편. 나름 누나라는 자각은 있는지 항상 마음속 깊이 제 동생을 챙기려 하고는… 있다!  결과적으론 하토가 아이미의 뒷수습을 하는 것은 물론이거니와 제멋대로 그를 이리저리 끌고 다니는 것뿐이지만.\n" +
  "\n" +
  "2-4. 방과후나 주말에는 하토와 반려견인 브로콜리와 함께 흙투성이가 된 채로 마을 이곳저곳을 쏘다니거나 산책하는 모습을 종종 볼 수 있다.\n" +
  "\n" +
  "\n" +
  "03. 호불호\n" +
  "3-1. LIKE : 분홍색, 마이멜로디 캐릭터, 디저트(중에서도 푸딩!), 친구들, 동물, 야외 활동과 그 외 재밌어 보이는 일이라면 뭐든!\n" +
  "3-2. HATE : 당근 (싫어하지만 억지로 꾹 참고 먹는다.)\n" +
  "\n" +
  "\n" +
  "04. 취미와 특기, 습관\n" +
  "4-1. 취미는 마을 탐방과 선물!\n" +
  "- 시간이 날 때마다 친구들과 동생의 손을 잡아끌고 마을 곳곳을 돌아다니는 것을 좋아한다. 온 동네를 쏘다니곤 해서 웬만한 마을 사람들의 얼굴은 익히 알고 있다. 최근 친구들 사이에서 떠도는 소문인 수수께끼 저택에 매우 관심이 많아 보이지만, 주변의 만류로 인해 아직 가보지는 못했다.\n" +
  "- 남들에게 이것저것 선물하는 것을 좋아한다. 제 입에 맛있는 음식이라면 꼭 주변에 있는 사람들에게 먹어보라 권하곤 했고, 같은 이유로 동생의 가방이나 낡은 야구 배트에 아기자기한 스티커를 붙여주곤 했다.\n" +
  "\n" +
  "4-2. 특기는 뜀틀 넘기와 동그라미 그리기.\n" +
  "- 또래보다 뜀틀을 무려 두 단이나 더 높게 뛰어넘을 수 있다.\n" +
  "- 누가 들으면 그게 무슨 특기냐며 타박할 수도 있겠지만, 동그라미를 단번에 예쁘게 그리는 것도 자랑이라면 자랑!\n" +
  "\n" +
  "4-3. 본인이 실수한 일이 있거나 변명을 덧붙일 때는 손가락으로 볼을 긁으며 시선을 피하는 버릇이 있다.\n");

</script>

<style scoped>

</style>
